# 02. Analysis Seoul Crime

[1. 프로젝트 개요](#프로젝트-개요) <br>
[2. 데이터 개요](#데이터-개요) <br>
[Pandas pivot table](#Pandas-pivot-table) <br>
[3. 서울시 범죄 현황 데이터 정리(pivot_table 사용)](#서울시-범죄-현황-데이터-정리) <br>
[4. Python 모듈 설치(pip, conda)](#python-모듈-설치) <br>


[Github에서는 toc가 작동안함. nbviewer로 보기👀](https://nbviewer.org/github/solpinetree/ds_study/blob/main/source_code/02.Analysis%20Seoul%20Crime.ipynb)

<a class="anchor" id="프로젝트-개요"></a>
## 1. 프로젝트 개요

<a class="anchor" id="데이터-개요"></a>
## 2. 데이터 개요

In [6]:
import numpy as np
import pandas as pd

In [7]:
# 데이터 읽기
crime_raw_data = pd.read_csv("../data/02.crime_in_Seoul.csv", thousands=",", encoding="euc-kr")
crime_raw_data.head()

   구분     죄종 발생검거   건수
0  중부     살인   발생    1
1  중부     살인   검거    2
2  중부     강도   발생    3
3  중부     강도   검거    2
4  중부  강간,추행   발생  137

In [8]:
crime_raw_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 310 entries, 0 to 309
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   구분      310 non-null    object
 1   죄종      310 non-null    object
 2   발생검거    310 non-null    object
 3   건수      310 non-null    int64
dtypes: int64(1), object(3)
memory usage: 9.8+ KB

- info() : 데이터의 개요 확인하기
- RangeIndex와 각 컬럼 count 비교

In [9]:
crime_raw_data["죄종"].unique()

array(['살인', '강도', '강간,추행', '절도', '폭력', '강간'], dtype=object)

In [10]:
crime_raw_data.head()

   구분     죄종 발생검거   건수
0  중부     살인   발생    1
1  중부     살인   검거    2
2  중부     강도   발생    3
3  중부     강도   검거    2
4  중부  강간,추행   발생  137

In [11]:
crime_raw_data.tail()

     구분     죄종 발생검거    건수
305  수서  강간,추행   검거   175
306  수서     절도   발생   930
307  수서     절도   검거   553
308  수서     폭력   발생  1268
309  수서     폭력   검거  1081

---

<a class="anchor" id="Pandas-pivot-table"></a>
## Pandas pivot table
- index, columns, values, aggfunc

In [12]:
df = pd.read_excel("../data/02.sales-funnel.xlsx")
df.head()

,Account,Name,Rep,Manager,Product,Quantity,Price,Status
0,714466,Trantow-Barrows,Craig Booker,Debra Henley,CPU,1,30000,presented
1,714466,Trantow-Barrows,Craig Booker,Debra Henley,Software,1,10000,presented
2,714466,Trantow-Barrows,Craig Booker,Debra Henley,Maintenance,2,5000,pending
3,737550,"Fritsch, Russel and Anderson",Craig Booker,Debra Henley,CPU,1,35000,declined
4,146832,Kiehn-Spinka,Daniel Hilton,Debra Henley,CPU,2,65000,won

### index 설정

In [13]:
df["Name"].unique()

array(['Trantow-Barrows', 'Fritsch, Russel and Anderson', 'Kiehn-Spinka',
       'Kulas Inc', 'Jerde-Hilpert', 'Barton LLC', 'Herman LLC',
       'Purdy-Kunde', 'Stokes LLC', 'Kassulke, Ondricka and Metz',
       'Keeling LLC', 'Koepp Ltd'], dtype=object)

In [14]:
# Name 컬럼을 인덱스로 설정
# pd.pivot_table(df, index="Name", values=["Account", "Price", "Quantity"])
# values로 집계 가능한 컬럼들만 넘겨야 작동을 함.
df.pivot_table(index="Name", values=["Account", "Price", "Quantity"])

                              Account   Price  Quantity
Name
Barton LLC                     740150   35000  1.000000
Fritsch, Russel and Anderson   737550   35000  1.000000
Herman LLC                     141962   65000  2.000000
Jerde-Hilpert                  412290    5000  2.000000
Kassulke, Ondricka and Metz    307599    7000  3.000000
Keeling LLC                    688981  100000  5.000000
Kiehn-Spinka                   146832   65000  2.000000
Koepp Ltd                      729833   35000  2.000000
Kulas Inc                      218895   25000  1.500000
Purdy-Kunde                    163416   30000  1.000000
Stokes LLC                     239344    7500  1.000000
Trantow-Barrows                714466   15000  1.333333

In [15]:
# 멀티 인덱스 설정
# values로 집계 가능한 컬럼들만 넘겨야 작동을 함.
df.pivot_table(index=["Name", "Rep", "Manager"], values=["Account", "Price", "Quantity"])

,,,Account,Price,Quantity
Name,Rep,Manager,,,
Barton LLC,John Smith,Debra Henley,740150,35000,1.000000
"Fritsch, Russel and Anderson",Craig Booker,Debra Henley,737550,35000,1.000000
Herman LLC,Cedric Moss,Fred Anderson,141962,65000,2.000000
Jerde-Hilpert,John Smith,Debra Henley,412290,5000,2.000000
"Kassulke, Ondricka and Metz",Wendy Yule,Fred Anderson,307599,7000,3.000000
Keeling LLC,Wendy Yule,Fred Anderson,688981,100000,5.000000
Kiehn-Spinka,Daniel Hilton,Debra Henley,146832,65000,2.000000
Koepp Ltd,Wendy Yule,Fred Anderson,729833,35000,2.000000
Kulas Inc,Daniel Hilton,Debra Henley,218895,25000,1.500000
Purdy-Kunde,Cedric Moss,Fred Anderson,163416,30000,1.000000
Stokes LLC,Cedric Moss,Fred Anderson,239344,7500,1.000000
Trantow-Barrows,Craig Booker,Debra Henley,714466,15000,1.333333

In [16]:
# 멀티 인덱스 설정
df.pivot_table(index=["Manager", "Rep"], values=["Account", "Price", "Quantity"])

                              Account         Price  Quantity
Manager       Rep
Debra Henley  Craig Booker   720237.0  20000.000000  1.250000
              Daniel Hilton  194874.0  38333.333333  1.666667
              John Smith     576220.0  20000.000000  1.500000
Fred Anderson Cedric Moss    196016.5  27500.000000  1.250000
              Wendy Yule     614061.5  44250.000000  3.000000

### values 설정( + aggfunc 설정)

In [17]:
df.head()

,Account,Name,Rep,Manager,Product,Quantity,Price,Status
0,714466,Trantow-Barrows,Craig Booker,Debra Henley,CPU,1,30000,presented
1,714466,Trantow-Barrows,Craig Booker,Debra Henley,Software,1,10000,presented
2,714466,Trantow-Barrows,Craig Booker,Debra Henley,Maintenance,2,5000,pending
3,737550,"Fritsch, Russel and Anderson",Craig Booker,Debra Henley,CPU,1,35000,declined
4,146832,Kiehn-Spinka,Daniel Hilton,Debra Henley,CPU,2,65000,won

In [18]:
# 기본 aggfunc는 np.mean
df.pivot_table(index=["Manager", "Rep"], values="Price")

                                    Price
Manager       Rep
Debra Henley  Craig Booker   20000.000000
              Daniel Hilton  38333.333333
              John Smith     20000.000000
Fred Anderson Cedric Moss    27500.000000
              Wendy Yule     44250.000000

In [19]:
# Price 컬럼에 sum 연산 적용
df.pivot_table(index=["Manager", "Rep"], values="Price", aggfunc=np.sum)

                              Price
Manager       Rep
Debra Henley  Craig Booker    80000
              Daniel Hilton  115000
              John Smith      40000
Fred Anderson Cedric Moss    110000
              Wendy Yule     177000

In [20]:
df.pivot_table(index=["Manager", "Rep"], values="Price", aggfunc=[np.sum, len])

                                sum   len
                              Price Price
Manager       Rep
Debra Henley  Craig Booker    80000     4
              Daniel Hilton  115000     3
              John Smith      40000     2
Fred Anderson Cedric Moss    110000     4
              Wendy Yule     177000     4

### columns 설정( + fill_value 설정)
Keys to group by on the pivot table column

In [21]:
df.head()

,Account,Name,Rep,Manager,Product,Quantity,Price,Status
0,714466,Trantow-Barrows,Craig Booker,Debra Henley,CPU,1,30000,presented
1,714466,Trantow-Barrows,Craig Booker,Debra Henley,Software,1,10000,presented
2,714466,Trantow-Barrows,Craig Booker,Debra Henley,Maintenance,2,5000,pending
3,737550,"Fritsch, Russel and Anderson",Craig Booker,Debra Henley,CPU,1,35000,declined
4,146832,Kiehn-Spinka,Daniel Hilton,Debra Henley,CPU,2,65000,won

In [22]:
# Product를 컬럼으로 지정
df.pivot_table(index=["Manager", "Rep"], values="Price", columns="Product", aggfunc=np.sum)

Product                           CPU  Maintenance  Monitor  Software
Manager       Rep
Debra Henley  Craig Booker    65000.0       5000.0      NaN   10000.0
              Daniel Hilton  105000.0          NaN      NaN   10000.0
              John Smith      35000.0       5000.0      NaN       NaN
Fred Anderson Cedric Moss     95000.0       5000.0      NaN   10000.0
              Wendy Yule     165000.0       7000.0   5000.0       NaN

In [23]:
# Nan 값 설정 : fill_value
df.pivot_table(index=["Manager", "Rep"], values="Price", columns="Product", aggfunc=np.sum, fill_value=0)

Product                         CPU  Maintenance  Monitor  Software
Manager       Rep
Debra Henley  Craig Booker    65000         5000        0     10000
              Daniel Hilton  105000            0        0     10000
              John Smith      35000         5000        0         0
Fred Anderson Cedric Moss     95000         5000        0     10000
              Wendy Yule     165000         7000     5000         0

###  2개 이상 index, values 설정

In [24]:
df.pivot_table(index=["Manager", "Rep", "Product"], values=["Price", "Quantity"], aggfunc=np.sum, fill_value=0)

                                          Price  Quantity
Manager       Rep           Product
Debra Henley  Craig Booker  CPU           65000         2
                            Maintenance    5000         2
                            Software      10000         1
              Daniel Hilton CPU          105000         4
                            Software      10000         1
              John Smith    CPU           35000         1
                            Maintenance    5000         2
Fred Anderson Cedric Moss   CPU           95000         3
                            Maintenance    5000         1
                            Software      10000         1
              Wendy Yule    CPU          165000         7
                            Maintenance    7000         3
                            Monitor        5000         2

In [25]:
df.pivot_table(
    index=["Manager", "Rep", "Product"], 
    values=["Price", "Quantity"], 
    aggfunc=[np.sum, np.mean], 
    fill_value=0,
    margins=True) # 총계(All) 추가

                                            sum                   mean  \
                                          Price Quantity         Price
Manager       Rep           Product
Debra Henley  Craig Booker  CPU           65000        2  32500.000000
                            Maintenance    5000        2   5000.000000
                            Software      10000        1  10000.000000
              Daniel Hilton CPU          105000        4  52500.000000
                            Software      10000        1  10000.000000
              John Smith    CPU           35000        1  35000.000000
                            Maintenance    5000        2   5000.000000
Fred Anderson Cedric Moss   CPU           95000        3  47500.000000
                            Maintenance    5000        1   5000.000000
                            Software      10000        1  10000.000000
              Wendy Yule    CPU          165000        7  82500.000000
                            Maintenance    7000        3   7000.000000
                            Monitor        5000        2   5000.000000
All                                      522000       30  30705.882353


                                         Quantity
Manager       Rep           Product
Debra Henley  Craig Booker  CPU          1.000000
                            Maintenance  2.000000
                            Software     1.000000
              Daniel Hilton CPU          2.000000
                            Software     1.000000
              John Smith    CPU          1.000000
                            Maintenance  2.000000
Fred Anderson Cedric Moss   CPU          1.500000
                            Maintenance  1.000000
                            Software     1.000000
              Wendy Yule    CPU          3.500000
                            Maintenance  3.000000
                            Monitor      2.000000
All                                      1.764706


---

<a class="anchor" id="서울시-범죄-현황-데이터-정리"></a>
## 3. 서울시 범죄 현황 데이터 정리(pivot_table 사용)

</detail>

In [26]:
crime_raw_data.head()

   구분     죄종 발생검거   건수
0  중부     살인   발생    1
1  중부     살인   검거    2
2  중부     강도   발생    3
3  중부     강도   검거    2
4  중부  강간,추행   발생  137

In [27]:
crime_station = crime_raw_data.pivot_table(
    crime_raw_data, 
    index="구분", 
    columns=["죄종", "발생검거"], 
    aggfunc=[np.sum],
    fill_value=0)

crime_station.head()

     sum
      건수
죄종    강간    강간,추행      강도    살인        절도          폭력
발생검거  검거 발생    검거   발생 검거 발생 검거  발생    검거    발생    검거    발생
구분
강남     0  0   359  458  8  9  5   6   654  1565  2178  2494
강동     0  0   134  157  5  5  6   5   900  1672  1599  1872
강북     0  0   147  177  6  5  4   5   589   872  1597  1773
강서     0  0   195  261  7  7  3   3  1185  1991  2201  2401
관악     0  0   279  327  8  9  8  10  1050  1966  2066  2567

In [28]:
crime_station.columns # Multiindex

MultiIndex([('sum', '건수',    '강간', '검거'),
            ('sum', '건수',    '강간', '발생'),
            ('sum', '건수', '강간,추행', '검거'),
            ('sum', '건수', '강간,추행', '발생'),
            ('sum', '건수',    '강도', '검거'),
            ('sum', '건수',    '강도', '발생'),
            ('sum', '건수',    '살인', '검거'),
            ('sum', '건수',    '살인', '발생'),
            ('sum', '건수',    '절도', '검거'),
            ('sum', '건수',    '절도', '발생'),
            ('sum', '건수',    '폭력', '검거'),
            ('sum', '건수',    '폭력', '발생')],
           names=[None, None, '죄종', '발생검거'])

### 죄종 컬럼에서 `강간`과 `강간,추행` 데이터 합침

In [29]:
crime_station["sum", "건수", "강간", "검거"]

구분
강남      0
강동      0
강북      0
강서      0
관악      0
광진      0
구로      0
금천      0
남대문     0
노원      0
도봉     54
동대문     0
동작      0
마포      0
방배     46
서대문     0
서부      0
서초      0
성동      0
성북     78
송파      0
수서      0
양천     92
영등포     0
용산      0
은평      0
종로      0
종암     51
중랑      0
중부      0
혜화      0
Name: (sum, 건수, 강간, 검거), dtype: int64

In [30]:
crime_station["sum", "건수", "강간,추행", "검거"]

구분
강남     359
강동     134
강북     147
강서     195
관악     279
광진     174
구로     145
금천      87
남대문     36
노원     151
도봉       0
동대문    106
동작     107
마포     368
방배       0
서대문    144
서부      64
서초     282
성동      97
성북       0
송파     220
수서     175
양천       0
영등포    237
용산     238
은평      82
종로     120
종암       0
중랑     121
중부      87
혜화      60
Name: (sum, 건수, 강간,추행, 검거), dtype: int64

In [31]:
crime_station["sum", "건수", "강간,추행", "검거"] = crime_station["sum", "건수", "강간,추행", "검거"]  + crime_station["sum", "건수", "강간", "검거"] 
crime_station["sum", "건수", "강간,추행", "검거"]

구분
강남     359
강동     134
강북     147
강서     195
관악     279
광진     174
구로     145
금천      87
남대문     36
노원     151
도봉      54
동대문    106
동작     107
마포     368
방배      46
서대문    144
서부      64
서초     282
성동      97
성북      78
송파     220
수서     175
양천      92
영등포    237
용산     238
은평      82
종로     120
종암      51
중랑     121
중부      87
혜화      60
Name: (sum, 건수, 강간,추행, 검거), dtype: int64

In [32]:
crime_station["sum", "건수", "강간", "발생"]

구분
강남       0
강동       0
강북       0
강서       0
관악       0
광진       0
구로       0
금천       0
남대문      0
노원       0
도봉      70
동대문      0
동작       0
마포       0
방배      61
서대문      0
서부       0
서초       0
성동       0
성북     103
송파       0
수서       0
양천     114
영등포      0
용산       0
은평       0
종로       0
종암      55
중랑       0
중부       0
혜화       0
Name: (sum, 건수, 강간, 발생), dtype: int64

In [33]:
crime_station["sum", "건수", "강간,추행", "발생"]

구분
강남     458
강동     157
강북     177
강서     261
관악     327
광진     230
구로     217
금천     127
남대문     57
노원     180
도봉       0
동대문    125
동작     212
마포     436
방배       0
서대문    157
서부      82
서초     370
성동     125
성북       0
송파     290
수서     209
양천       0
영등포    327
용산     280
은평      94
종로     142
종암       0
중랑     150
중부     137
혜화      86
Name: (sum, 건수, 강간,추행, 발생), dtype: int64

In [34]:
crime_station["sum", "건수", "강간,추행", "발생"] = crime_station["sum", "건수", "강간,추행", "발생"]  + crime_station["sum", "건수", "강간", "발생"] 
crime_station["sum", "건수", "강간,추행", "발생"]

구분
강남     458
강동     157
강북     177
강서     261
관악     327
광진     230
구로     217
금천     127
남대문     57
노원     180
도봉      70
동대문    125
동작     212
마포     436
방배      61
서대문    157
서부      82
서초     370
성동     125
성북     103
송파     290
수서     209
양천     114
영등포    327
용산     280
은평      94
종로     142
종암      55
중랑     150
중부     137
혜화      86
Name: (sum, 건수, 강간,추행, 발생), dtype: int64

In [35]:
crime_station.columns

MultiIndex([('sum', '건수',    '강간', '검거'),
            ('sum', '건수',    '강간', '발생'),
            ('sum', '건수', '강간,추행', '검거'),
            ('sum', '건수', '강간,추행', '발생'),
            ('sum', '건수',    '강도', '검거'),
            ('sum', '건수',    '강도', '발생'),
            ('sum', '건수',    '살인', '검거'),
            ('sum', '건수',    '살인', '발생'),
            ('sum', '건수',    '절도', '검거'),
            ('sum', '건수',    '절도', '발생'),
            ('sum', '건수',    '폭력', '검거'),
            ('sum', '건수',    '폭력', '발생')],
           names=[None, None, '죄종', '발생검거'])

In [36]:
crime_station.drop([("sum", "건수", "강간", "발생"), ("sum", "건수", "강간", "검거")], axis = 1, inplace=True)
crime_station.head()

       sum
        건수
죄종   강간,추행      강도    살인        절도          폭력
발생검거    검거   발생 검거 발생 검거  발생    검거    발생    검거    발생
구분
강남     359  458  8  9  5   6   654  1565  2178  2494
강동     134  157  5  5  6   5   900  1672  1599  1872
강북     147  177  6  5  4   5   589   872  1597  1773
강서     195  261  7  7  3   3  1185  1991  2201  2401
관악     279  327  8  9  8  10  1050  1966  2066  2567

### MultiIndex 정리

In [37]:
crime_station.columns

MultiIndex([('sum', '건수', '강간,추행', '검거'),
            ('sum', '건수', '강간,추행', '발생'),
            ('sum', '건수',    '강도', '검거'),
            ('sum', '건수',    '강도', '발생'),
            ('sum', '건수',    '살인', '검거'),
            ('sum', '건수',    '살인', '발생'),
            ('sum', '건수',    '절도', '검거'),
            ('sum', '건수',    '절도', '발생'),
            ('sum', '건수',    '폭력', '검거'),
            ('sum', '건수',    '폭력', '발생')],
           names=[None, None, '죄종', '발생검거'])

In [38]:
crime_station.columns = crime_station.columns.droplevel([0, 1]) # 다중 컬럼에서 특정 컬럼 제거

In [39]:
crime_station.columns

MultiIndex([('강간,추행', '검거'),
            ('강간,추행', '발생'),
            (   '강도', '검거'),
            (   '강도', '발생'),
            (   '살인', '검거'),
            (   '살인', '발생'),
            (   '절도', '검거'),
            (   '절도', '발생'),
            (   '폭력', '검거'),
            (   '폭력', '발생')],
           names=['죄종', '발생검거'])

In [40]:
crime_station.head()

죄종   강간,추행      강도    살인        절도          폭력
발생검거    검거   발생 검거 발생 검거  발생    검거    발생    검거    발생
구분
강남     359  458  8  9  5   6   654  1565  2178  2494
강동     134  157  5  5  6   5   900  1672  1599  1872
강북     147  177  6  5  4   5   589   872  1597  1773
강서     195  261  7  7  3   3  1185  1991  2201  2401
관악     279  327  8  9  8  10  1050  1966  2066  2567

### index 확인

In [41]:
crime_station.index

Index(['강남', '강동', '강북', '강서', '관악', '광진', '구로', '금천', '남대문', '노원', '도봉',
       '동대문', '동작', '마포', '방배', '서대문', '서부', '서초', '성동', '성북', '송파', '수서',
       '양천', '영등포', '용산', '은평', '종로', '종암', '중랑', '중부', '혜화'],
      dtype='object', name='구분')

- 현재 index는 경찰서 이름으로 되어있음
- 경찰서 이름으로 구 이름을 알아내야함

---

<a class="anchor" id="python-모듈-설치"></a>
## 4. Python 모듈 설치

### pip 명령
- python의 공식 모듈 관리자
- pip list
- pip install module_name
- pip uninstall module_name

In [42]:
# !pip list
get_ipython().system("pip list")

Package                   Version
------------------------- -----------
anyio                     4.2.0
appnope                   0.1.2
argon2-cffi               21.3.0
argon2-cffi-bindings      21.2.0
asttokens                 2.0.5
async-lru                 2.0.4
attrs                     23.1.0
Babel                     2.11.0
backcall                  0.2.0
beautifulsoup4            4.12.3
bleach                    4.1.0
Bottleneck                1.3.7
Brotli                    1.0.9
certifi                   2024.7.4
cffi                      1.16.0
charset-normalizer        2.0.4
comm                      0.2.1
contourpy                 1.0.5
cycler                    0.11.0
debugpy                   1.6.7
decorator                 5.1.1
defusedxml                0.7.1
et-xmlfile                1.1.0
exceptiongroup            1.2.0
executing                 0.8.3
fastjsonschema            2.16.2
fonttools                 4.51.0
googlemaps                4.10.0
idna                      3.7
importlib-metadata        7.0.1
importlib_resources       6.4.0
ipykernel                 6.28.0
ipython                   8.12.2
ipywidgets                8.1.2
jedi                      0.18.1
Jinja2                    3.1.4
json5                     0.9.6
jsonschema                4.19.2
jsonschema-specifications 2023.7.1
jupyter                   1.0.0
jupyter_client            8.6.0
jupyter-console           6.6.3
jupyter_core              5.7.2
jupyter-events            0.10.0
jupyter-lsp               2.2.0
jupyter_server            2.14.1
jupyter_server_terminals  0.4.4
jupyterlab                4.0.11
jupyterlab-pygments       0.1.2
jupyterlab_server         2.25.1
jupyterlab-widgets        3.0.10
kiwisolver                1.4.4
MarkupSafe                2.1.3
matplotlib                3.7.2
matplotlib-inline         0.1.6
mistune                   2.0.4
mkl-fft                   1.3.1
mkl-random                1.2.2
mkl-service               2.4.0
nbclient                  0.8.0
nbconvert                 7.10.0
nbformat                  5.9.2
nest-asyncio              1.6.0
notebook                  7.0.8
notebook_shim             0.2.3
numexpr                   2.8.4
numpy                     1.24.3
openpyxl                  3.1.2
overrides                 7.4.0
packaging                 24.1
pandas                    2.0.3
pandocfilters             1.5.0
parso                     0.8.3
pexpect                   4.8.0
pickleshare               0.7.5
pillow                    10.3.0
pip                       24.0
pkgutil_resolve_name      1.3.10
platformdirs              3.10.0
ply                       3.11
prometheus-client         0.14.1
prompt-toolkit            3.0.43
psutil                    5.9.0
ptyprocess                0.7.0
pure-eval                 0.2.2
pycparser                 2.21
Pygments                  2.15.1
pyparsing                 3.0.9
PyQt5                     5.15.10
PyQt5-sip                 12.13.0
PySocks                   1.7.1
python-dateutil           2.9.0.post0
python-json-logger        2.0.7
pytz                      2024.1
PyYAML                    6.0.1
pyzmq                     25.1.2
qtconsole                 5.5.1
QtPy                      2.4.1
referencing               0.30.2
requests                  2.32.2
rfc3339-validator         0.1.4
rfc3986-validator         0.1.1
rpds-py                   0.10.6
Send2Trash                1.8.2
setuptools                69.5.1
sip                       6.7.12
six                       1.16.0
sniffio                   1.3.0
soupsieve                 2.5
stack-data                0.2.0
terminado                 0.17.1
tinycss2                  1.2.1
tomli                     2.0.1
tornado                   6.4.1
traitlets                 5.14.3
typing_extensions         4.11.0
tzdata                    2023.3
unicodedata2              15.1.0
urllib3                   2.2.2
wcwidth                   0.2.5
webencodings              0.5.1
websocket-client          1.8.0
wheel                     0.43.0
widgetsnbextension        4.0.10
xlrd                      2.0.1
zipp                      3.17.0

### conda 명령
- conda list
- conda install module_name
- conda uninstall module_name
- conda install -c channel_name module_name
    - 지정된 배포 채널에서 모듈 설치

---

## 5. Google Maps API 설치

In [49]:
import googlemaps

In [56]:
from dotenv import load_dotenv
import os

load_dotenv('.env')
gmaps_key = os.environ.get('GCP_API_KEY')
gmaps = googlemaps.Client(key=gmaps_key)

In [57]:
gmaps.geocode("서울영등포경찰서", language="ko")

[{'address_components': [{'long_name': '608',
    'short_name': '608',
    'types': ['premise']},
   {'long_name': '국회대로',
    'short_name': '국회대로',
    'types': ['political', 'sublocality', 'sublocality_level_4']},
   {'long_name': '영등포구',
    'short_name': '영등포구',
    'types': ['political', 'sublocality', 'sublocality_level_1']},
   {'long_name': '서울특별시',
    'short_name': '서울특별시',
    'types': ['administrative_area_level_1', 'political']},
   {'long_name': '대한민국',
    'short_name': 'KR',
    'types': ['country', 'political']},
   {'long_name': '150-043',
    'short_name': '150-043',
    'types': ['postal_code']}],
  'formatted_address': '대한민국 서울특별시 영등포구 국회대로 608',
  'geometry': {'location': {'lat': 37.5260441, 'lng': 126.9008091},
   'location_type': 'ROOFTOP',
   'viewport': {'northeast': {'lat': 37.5273930802915,
     'lng': 126.9021580802915},
    'southwest': {'lat': 37.5246951197085, 'lng': 126.8994601197085}}},
  'partial_match': True,
  'place_id': 'ChIJ1TimJLaffDURptXOs0Tj6sY',
  'plus_code': {'compound_code': 'GWG2+C8 대한민국 서울특별시',
   'global_code': '8Q98GWG2+C8'},
  'types': ['establishment', 'point_of_interest', 'police']}]